
def area(a):
    '''
    Возвращает площадь квадрата

        Параметры: 
            a(int): длина квадрата
            b(int): ширина квадрата
        
        Возвращаемое значение:
            a*b: искомая площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата

        Параметры: 
            a(int): длина квадрата
            b(int): ширина квадрата
        
        Возвращаемое значение:
            4*a: искомый периметр квадрата
    '''
    return 4 * a
