def area(a,h):
    '''
    Возвращает площадь треугольника

        Параметры:
            a(int): основание треугольника
            h(int): высота треугольника
        
        Возвращаемое значение:
            a*h/2: искомая площадь треугольника
    '''
    return a*h/2

def perimeter(a,b,c):
    '''
    Возвращает периметр треугольника

        Параметры:
            a(int): одна сторона треугольника
            b(int): вторая сторона треугольника
            c(int): третья сторона треугольника
        
        Возвращаемое значение: 
            a+b+c: искомый периметр треугольника
    '''
    return a+b+c